/**
 * รายการข้อหาสำหรับ Blacklist
 */
export const BLACKLIST_CHARGES = [
  'แพทย์ลงพื้นที่ไม่พบเคส (ไม่มีการรายงานตัว หรือมาชำระค่าปรับตามที่เรียก) ภายใน 10 นาที นับจากกดเรียกเคส',
  'ก่อเหตุ / ก่อความไม่สงบ ในพื้นที่โรงพยาบาล (ทะเลาะ , ด่า , บั๊มรถ , บีบแตรรบกวน หรือก่อความวุ่นวายอื่นๆ)',
  'พูดจาหมิ่นประมาทเจ้าหน้าที่ (Toxic ตามกฎประเทศ)',
  'ทำร้ายร่างกายแพทย์ ยกเว้น แพทย์ที่เข้าเคสอุ้มเอ๋อเท่านั้น',
  'ก่อกวน/ขัดขวางการทำงาน',
  'ทำร้ายร่างกายกันต่อหน้าแพทย์',
  'บลัฟกันต่อหน้าแพทย์ (กรณีแพทย์เข้ารับเคสในจุดที่มีการทะเลาะวิวาท หรือ เคสสตอรี่นอก รวมถึงมีการตักเตือน และแจ้งแล้ว)',
  'ควัก, ถืออาวุธต่อหน้าแพทย์',
  'กดเรียกเคสจากในวอโซน แอร์ดรอป หรือกิจกรรมประเทศอื่น ๆ ที่แพทย์ไม่สามารถเข้าไปทำการชุบได้',
  'ขโมยรถหรือฮอแพทย์',
  'เข้าพื้นที่ส่วนหน่วยงานโดยไม่ได้รับอนุญาตจากแพทย์ (ห้องที่มีการล็อกไม่ให้เข้า / จุดเบิกฮอ / จุดจอดฮอ)',
  'นำ หรือ ขับ พาหนะทุกชนิดเข้ามาภายในโรงพยาบาล (รวมไปถึง สเก็ตบอร์ด)',
  'ไม่สวมหรือถอดเสื้อผ้า / สวมใส่หน้ากากหรือปิดบังใบหน้าในเขตโรงพยาบาล',
  'ถ่ายรูปติดหน่วยงานแพทย์,ยานพาหนะแพทย์ ลงทวิตเตอร์ (เพื่อปลุกปั่นหรือ โพสต์เชิงลบ)',
  'โพสต์บัพหน่วยงานแพทย์ หรือทำให้หน่วยงานและองค์กรเสียหายผ่านทวิตเตอร์',
  'ทะเลาะวิวาท ตี หรือ ปะทะกันในขณะที่มีคูลดาวน์สตอรี่',
  'ใช้พื้นที่โรงพยาบาลเป็นที่พักพิง ขณะมีสตอรี่ (เมื่อครบ 15 นาที และมีการเตือน 1 ครั้ง หากยังไม่ออกจากพื้นที่จะ BLACKLIST ทันที)',
  'หาก Gang หรือ Family ติด BLACKLIST กับทางโรงพยาบาลอยู่ แล้วทำการยุบ Gang หรือ Family',
] as const;

export type BlacklistCharge = typeof BLACKLIST_CHARGES[number];
